Backward Facing Step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 -0.5) // 0
    (15 0 -0.5) // 1
    (-5 1 -0.5) // 2
    (0 1 -0.5) // 3
    (15 1 -0.5) // 4
    (-5 4 -0.5) // 5
    (0 4 -0.5) // 6
    (15 4 -0.5) // 7
    (0 0 0.5) // 8
    (15 0 0.5) // 9
    (-5 1 0.5) // 10
    (0 1 0.5) // 11
    (15 1 0.5) // 12
    (-5 4 0.5) // 13
    (0 4 0.5) // 14
    (15 4 0.5) // 15
);

blocks
(
    hex (0 1 4 3 8 9 12 11) (150 36 1)
    simpleGrading
    (2 // x - dir
    (
        (0.5 0.6 6) // bottom 50% contains 60% cells with grading 6
        (0.5 0.4 0.2) // upper 50% contains 40% cells with grading 0.2
    ) // y - dir
    1) // z - dir

    hex (2 3 6 5 10 11 14 13) (50 52 1)
    simpleGrading
    (0.5
        (
        (0.5 0.6 6)
        (0.5 0.4 0.2)
    
    )
    1)
    
    hex (3 4 7 6 11 12 15 14) (150 52 1)
    simpleGrading
    (2
    (
        (0.5 0.6 6)
        (0.5 0.4 0.2)
    )
    1)
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 5 13 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
        (1 4 12 9)
        (4 7 15 12)
        );
    }
    fixedWalls_bottom
    {
        type wall;
        faces
        (
            (2 3 11 10)
            (3 0 8 11)
            (0 1 9 8)
        );
    }
    fixedWalls_top
    {
        type wall;
        faces
        (
        (5 6 14 13)
        (6 7 15 14)
        );
    }
);



// ************************************************************************* //
