Backward Facing Step/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type zeroGradient;
    }
    fixedWalls_bottom
    {
        type fixedValue;
        value uniform (0 0 0);
}
    fixedWalls_top
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    inlet{
        type fixedValue;
        value nonuniform List<vector>
52
(
(0.044973 0 0)
(0.132863 0 0)
(0.219475 0 0)
(0.304363 0 0)
(0.387049 0 0)
(0.467068 0 0)
(0.543909 0 0)
(0.617125 0 0)
...
)
;
}

}


// ************************************************************************* //
