Backward Facing Step/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
15800
(
(0.00346481 0.000402336 0)
(0.0104106 0.000402336 0)
(0.0173888 0.000402336 1.02799e-18)
(0.0243995 0.000402336 0)
(0.0314429 0.000402336 0)
(0.0385191 0.000402336 0)
(0.0456283 0.000402336 4.81868e-20)
(0.0527707 0.000402336 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
52
(
(-0.5 0.10086 0)
(-0.5 0.102632 0)
(-0.5 0.104513 0)
(-0.5 0.10651 0)
(-0.5 0.10863 0)
(-0.5 0.110881 0)
(-0.5 0.11327 0)
(-0.5 0.115806 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
88
(
(1.5 0.000402336 0)
(1.5 0.00124284 0)
(1.5 0.00215821 0)
(1.5 0.00315511 0)
(1.5 0.0042408 0)
(1.5 0.00542319 0)
(1.5 0.00671089 0)
(1.5 0.00811328 0)
...
)
;
    }
    fixedWalls_bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
236
(
(-0.493074 0.1 0)
(-0.47932 0.1 0)
(-0.465758 0.1 0)
(-0.452388 0.1 0)
(-0.439205 0.1 0)
(-0.426207 0.1 0)
(-0.413392 0.1 0)
(-0.400757 0.1 0)
...
)
;
    }
    fixedWalls_top
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(-0.493074 0.4 0)
(-0.47932 0.4 0)
(-0.465758 0.4 0)
(-0.452388 0.4 0)
(-0.439205 0.4 0)
(-0.426207 0.4 0)
(-0.413392 0.4 0)
(-0.400757 0.4 0)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
