Backward Facing Step/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
15800
(
0.00346481
0.0104106
0.0173888
0.0243995
0.0314429
0.0385191
0.0456283
0.0527707
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
88
(
1.5
1.5
1.5
1.5
1.5
1.5
1.5
1.5
...
)
;
    }
    fixedWalls_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
236
(
-0.493074
-0.47932
-0.465758
-0.452388
-0.439205
-0.426207
-0.413392
-0.400757
...
)
;
    }
    fixedWalls_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-0.493074
-0.47932
-0.465758
-0.452388
-0.439205
-0.426207
-0.413392
-0.400757
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
