Backward Facing Step/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
15800
(
0.000402336
0.000402336
0.000402336
0.000402336
0.000402336
0.000402336
0.000402336
0.000402336
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
0.10086
0.102632
0.104513
0.10651
0.10863
0.110881
0.11327
0.115806
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
88
(
0.000402336
0.00124284
0.00215821
0.00315511
0.0042408
0.00542319
0.00671089
0.00811328
...
)
;
    }
    fixedWalls_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
236
(
0.1
0.1
0.1
0.1
0.1
0.1
0.1
0.1
...
)
;
    }
    fixedWalls_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.4
0.4
0.4
0.4
0.4
0.4
0.4
0.4
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
