Backward Facing Step/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 1;
    }
    outlet
    {
        type zeroGradient;
    }
    fixedWalls_bottom
    {
        type epsilonWallFunction;
        value uniform 1;
    }
    fixedWalls_top
    {
        type epsilonWallFunction;
        value uniform 1;
    }
}


// ************************************************************************* //
